; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p2---int100n150-m25---int100c200---s3---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 - fuellevel
)

(:init
(sum level0 level11 level11)
(sum level0 level23 level23)
(sum level1 level11 level12)
(sum level1 level23 level24)
(sum level2 level11 level13)
(sum level2 level23 level25)
(sum level3 level11 level14)
(sum level3 level23 level26)
(sum level4 level11 level15)
(sum level4 level23 level27)
(sum level5 level11 level16)
(sum level5 level23 level28)
(sum level6 level11 level17)
(sum level6 level23 level29)
(sum level7 level11 level18)
(sum level7 level23 level30)
(sum level8 level11 level19)
(sum level8 level23 level31)
(sum level9 level11 level20)
(sum level9 level23 level32)
(sum level10 level11 level21)
(sum level10 level23 level33)
(sum level11 level11 level22)
(sum level11 level23 level34)
(sum level12 level11 level23)
(sum level12 level23 level35)
(sum level13 level11 level24)
(sum level13 level23 level36)
(sum level14 level11 level25)
(sum level14 level23 level37)
(sum level15 level11 level26)
(sum level15 level23 level38)
(sum level16 level11 level27)
(sum level16 level23 level39)
(sum level17 level11 level28)
(sum level17 level23 level40)
(sum level18 level11 level29)
(sum level18 level23 level41)
(sum level19 level11 level30)
(sum level19 level23 level42)
(sum level20 level11 level31)
(sum level20 level23 level43)
(sum level21 level11 level32)
(sum level21 level23 level44)
(sum level22 level11 level33)
(sum level22 level23 level45)
(sum level23 level11 level34)
(sum level23 level23 level46)
(sum level24 level11 level35)
(sum level24 level23 level47)
(sum level25 level11 level36)
(sum level25 level23 level48)
(sum level26 level11 level37)
(sum level26 level23 level49)
(sum level27 level11 level38)
(sum level27 level23 level50)
(sum level28 level11 level39)
(sum level28 level23 level51)
(sum level29 level11 level40)
(sum level29 level23 level52)
(sum level30 level11 level41)
(sum level30 level23 level53)
(sum level31 level11 level42)
(sum level31 level23 level54)
(sum level32 level11 level43)
(sum level32 level23 level55)
(sum level33 level11 level44)
(sum level33 level23 level56)
(sum level34 level11 level45)
(sum level34 level23 level57)
(sum level35 level11 level46)
(sum level35 level23 level58)
(sum level36 level11 level47)
(sum level36 level23 level59)
(sum level37 level11 level48)
(sum level37 level23 level60)
(sum level38 level11 level49)
(sum level38 level23 level61)
(sum level39 level11 level50)
(sum level39 level23 level62)
(sum level40 level11 level51)
(sum level40 level23 level63)
(sum level41 level11 level52)
(sum level41 level23 level64)
(sum level42 level11 level53)
(sum level42 level23 level65)
(sum level43 level11 level54)
(sum level43 level23 level66)
(sum level44 level11 level55)
(sum level44 level23 level67)
(sum level45 level11 level56)
(sum level45 level23 level68)
(sum level46 level11 level57)
(sum level46 level23 level69)
(sum level47 level11 level58)
(sum level47 level23 level70)
(sum level48 level11 level59)
(sum level48 level23 level71)
(sum level49 level11 level60)
(sum level49 level23 level72)
(sum level50 level11 level61)
(sum level50 level23 level73)
(sum level51 level11 level62)
(sum level51 level23 level74)
(sum level52 level11 level63)
(sum level52 level23 level75)
(sum level53 level11 level64)
(sum level53 level23 level76)
(sum level54 level11 level65)
(sum level54 level23 level77)
(sum level55 level11 level66)
(sum level55 level23 level78)
(sum level56 level11 level67)
(sum level56 level23 level79)
(sum level57 level11 level68)
(sum level57 level23 level80)
(sum level58 level11 level69)
(sum level58 level23 level81)
(sum level59 level11 level70)
(sum level59 level23 level82)
(sum level60 level11 level71)
(sum level60 level23 level83)
(sum level61 level11 level72)
(sum level61 level23 level84)
(sum level62 level11 level73)
(sum level62 level23 level85)
(sum level63 level11 level74)
(sum level63 level23 level86)
(sum level64 level11 level75)
(sum level64 level23 level87)
(sum level65 level11 level76)
(sum level65 level23 level88)
(sum level66 level11 level77)
(sum level66 level23 level89)
(sum level67 level11 level78)
(sum level67 level23 level90)
(sum level68 level11 level79)
(sum level69 level11 level80)
(sum level70 level11 level81)
(sum level71 level11 level82)
(sum level72 level11 level83)
(sum level73 level11 level84)
(sum level74 level11 level85)
(sum level75 level11 level86)
(sum level76 level11 level87)
(sum level77 level11 level88)
(sum level78 level11 level89)
(sum level79 level11 level90)

(connected l0 l1)
(fuelcost level23 l0 l1)
(connected l0 l2)
(fuelcost level23 l0 l2)
(connected l1 l0)
(fuelcost level23 l1 l0)
(connected l1 l2)
(fuelcost level11 l1 l2)
(connected l2 l0)
(fuelcost level23 l2 l0)
(connected l2 l1)
(fuelcost level11 l2 l1)

(at t0 l0)
(fuel t0 level90)
(= (total-cost) 0)

(at p0 l2)
(at p1 l1)
)

(:goal
(and
(at p0 l1)
(at p1 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l0 l1 level67 level23 level90)
   deleted: (at t0 l0) (fuel t0 level90)
   added: (at t0 l1) (fuel t0 level67)
   goals met: 0 of 2
2. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 2
3. (drive t0 l1 l2 level56 level11 level67)
   deleted: (at t0 l1) (fuel t0 level67)
   added: (at t0 l2) (fuel t0 level56)
   goals met: 0 of 2
4. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 2
5. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 1 of 2
6. (drive t0 l2 l1 level45 level11 level56)
   deleted: (at t0 l2) (fuel t0 level56)
   added: (at t0 l1) (fuel t0 level45)
   goals met: 1 of 2
7. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 2 of 2
